<a href="https://colab.research.google.com/github/tushar831/aiwinter1920/blob/master/pandasinfo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
df=pd.read_csv('http://54.166.189.131/datasets/info.csv')
#this support local path and url as well.

In [9]:
#df
df.head(4) #only top 4 lines

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No

In [10]:
df.head() #default top 5 lines

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [12]:
#for any specific coloumns
df['Country']

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [14]:
df.iloc[0:3] #for specific number of rows

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

In [18]:
df.iloc[[3,5],[1,2]] #for specific rows and coloumns

    Age   Salary
3  38.0  61000.0
5  35.0  58000.0

In [20]:
df.iloc[[3,5],[1,2]].values #for changing into numpy

array([[3.8e+01, 6.1e+04],
       [3.5e+01, 5.8e+04]])

In [21]:
max(df['Age'])

50.0

In [25]:
min(df['Age'])

27.0

In [0]:
[i for i in dir(pd) if'read']